test-results/2025-12-20/microservices/stress_r3/summary.txt
     █ login-Pemohon

       ✓ signin status is 200
       ✓ signin success flag

       █ pemohon-flow

         ✓ create permohonan 201
         ✓ submit permohonan ok

     █ login-OPD

       ✓ signin status is 200
       ✓ signin success flag

       █ opd-flow

         ✓ kajian status ok

     █ login-Pimpinan

       ✓ signin status is 200
       ✓ signin success flag

       █ pimpinan-flow

         ✓ draft approve ok

     █ login-Admin

       ✓ signin status is 200
       ✓ signin success flag

       █ admin-flow

         ✓ list permohonan 200
         ✓ approve 200
         ✓ disposisi status 201

   ✓ auth_latency...................: avg=155.75ms min=56.82ms  p(50)=133.01ms p(90)=273.9ms p(95)=326.57ms p(99)=427.59ms max=651.41ms
     checks.........................: 100.00% ✓ 11757     ✗ 0    
     data_received..................: 11 MB   23 kB/s
     data_sent......................: 6.0 MB  12 kB/s
     group_duration.................: avg=9.61s    min=8.68ms   p(50)=10.52s   p(90)=14.36s  p(95)=15.6s    p(99)=18.8s    max=23.91s  
     http_req_blocked...............: avg=8.29µs   min=0s       p(50)=0s       p(90)=0s      p(95)=0s       p(99)=407.71µs max=10.01ms 
     http_req_connecting............: avg=1.99µs   min=0s       p(50)=0s       p(90)=0s      p(95)=0s       p(99)=0s       max=1.38ms  
   ✓ http_req_duration..............: avg=880.77ms min=650.9µs  p(50)=597.7ms  p(90)=2.01s   p(95)=2.6s     p(99)=3.57s    max=5.73s   
       { expected_response:true }...: avg=880.77ms min=650.9µs  p(50)=597.7ms  p(90)=2.01s   p(95)=2.6s     p(99)=3.57s    max=5.73s   
   ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 18016
     http_req_receiving.............: avg=97.02µs  min=0s       p(50)=0s       p(90)=508.1µs p(95)=524.4µs  p(99)=1.19ms   max=10.04ms 
     http_req_sending...............: avg=20.8µs   min=0s       p(50)=0s       p(90)=0s      p(95)=0s       p(99)=522.5µs  max=9.5ms   
     http_req_tls_handshaking.......: avg=0s       min=0s       p(50)=0s       p(90)=0s      p(95)=0s       p(99)=0s       max=0s      
     http_req_waiting...............: avg=880.66ms min=650.9µs  p(50)=597.7ms  p(90)=2.01s   p(95)=2.6s     p(99)=3.57s    max=5.73s   
     http_reqs......................: 18016   37.058736/s
     iteration_duration.............: avg=10.68s   min=1.39s    p(50)=11.75s   p(90)=15.01s  p(95)=16.14s   p(99)=19.62s   max=23.91s  
     iterations.....................: 2977    6.12366/s
   ✓ permohonan_latency.............: avg=1.62s    min=15.46ms  p(50)=1.5s     p(90)=2.96s   p(95)=3.35s    p(99)=4.22s    max=5.73s   
   ✓ survey_latency.................: avg=900.15ms min=212.77ms p(50)=749.23ms p(90)=1.65s   p(95)=1.95s    p(99)=2.77s    max=3.36s   
     vus............................: 1       min=1       max=75 
     vus_max........................: 75      min=75      max=75 
   ✓ workflow_latency...............: avg=756.48ms min=650.9µs  p(50)=441.39ms p(90)=2.2s    p(95)=2.85s    p(99)=3.62s    max=5.3s